# Aula 6: Estruturação do banco e JOIN us ON su.c = e.sso;

## PROJETO

- Duplinha ou não;
- Escolha um dataset de sua preferência (Kaggle, UCI,...);
- https://www.kaggle.com/datasets;
- https://archive.ics.uci.edu/datasets;
- Coloque-o no postgres (hmmmm... como? ...) (DESAFIO); 
- Usando o Jupyter notebook, faça uma análise descritiva;
    - Qual as tipagens das colunas?;
    - Quantos nulos temos em cada coluna?;
    - Quantos valores únicos temos nas colunas categoricas?;
    - ...;
- Ainda no Jupyter, faça 10 perguntas ao seu dataset e responda-as com querys;
    - Qual o top 10 vendas?;
    - Qual o top 5 clientes?;
    - Qual medida é minoria?;
    - ...;
- Organize tudo em um HTML e entregue este relatório;
- Entrega até 15/12 as 23h59 (OS DOIS DA DUPLA DEVEM ME ENVIAR)
- r.otavioms@gmail.com

# Integridade entre as tabelas:

- PRIMARY KEY;
- FOREIGN KEY;
- ON UPDATE CASCADE;
- ON DELETE CASCADE;

# Agora sim podemos criar toda a base com o arquivo comandos_postgre.sql

In [3]:
from sqlalchemy import create_engine
import pandas as pd

# SGBD://USER:SENHA@HOST/DATABASE

engine = create_engine('postgresql+psycopg2://postgres:senha@localhost/postgres')
conn = engine.connect()

In [4]:
# Conecte o curso a tabela de transações
query = "SELECT * FROM ada.transacoes"

pd.read_sql_query(query, con = conn)

    id_transacao  id_aluno  id_curso  id_vendedor  id_pagamento
0              1         1         1            1             1
1              2         2         1            2             2
2              3         3         1            1             2
3              4         4         1            2             1
4              5         5         1            1             3
5              6         6         1            1             3
6              7         7         1            2             1
7              8         8         1            2             1
8              9         9         2            1             4
9             10        10         2            2             4
10            11        11         2            2             2
11            12        12         2            2             1
12            13        13         2            2             1
13            14        14         2            1             1
14            15        15         2            1             5
15            16        16         2            1             2
16            17        17         2            1             2
17            18        18         2            3             3
18            19        19         2            3             5
19            20        20         2            3             3
20            21        21         2            1             1
21            22        22         3            3             5
22            23        23         3            3             5
23            24        24         3            3             4
24            25        25         3            3             4
25            26        26         3            1             5
26            27        27         3            1             2
27            28        28         3            1             2
28            29        29         3            1             5
29            30        30         4            2             5
30            31        31         4            2             2
31            32        32         4            2             2
32            33        33         4            2             2
33            34        34         4            2             5

In [5]:
# Conecte o curso a tabela de transações
query = "SELECT * FROM ada.vendedores"

pd.read_sql_query(query, con = conn)

   id_vendedor vendedor
0            1    paulo
1            2  adriana
2            3    nadir

In [6]:
# !jupyter nbconvert --execute --to html aula_6.ipynb

In [7]:
# conectem a tabela de transações com a tabela de vendedores
query = """
SELECT 
    *
FROM 
ada.transacoes AS t
LEFT JOIN ada.vendedores AS v ON t.id_vendedor = v.id_vendedor
LIMIT 5
"""

pd.read_sql_query(query, con = conn)

,id_transacao,id_aluno,id_curso,id_vendedor,id_pagamento,id_vendedor,vendedor
0,1,1,1,1,1,1,paulo
1,2,2,1,2,2,2,adriana
2,3,3,1,1,2,1,paulo
3,4,4,1,2,1,2,adriana
4,5,5,1,1,3,1,paulo

In [8]:
query = """
SELECT 
    t.id_transacao,
    t.id_aluno, 
    t.id_curso,
    v.id_vendedor, 
    v.vendedor
FROM 
ada.transacoes AS t
LEFT JOIN ada.vendedores AS v ON t.id_vendedor = v.id_vendedor
LIMIT 5
"""

pd.read_sql_query(query, con = conn)

   id_transacao  id_aluno  id_curso  id_vendedor vendedor
0             1         1         1            1    paulo
1             2         2         1            2  adriana
2             3         3         1            1    paulo
3             4         4         1            2  adriana
4             5         5         1            1    paulo

## Bem vindo ao GROUP BY

GROUP BY 

Funções possíveis: 

- SUM(nome_coluna) -> Soma dos valores
- AVG(nome_coluna) -> Média dos valores
- MIN(nome_coluna) -> Valor mínimo
- MAX(nome_coluna) -> Valor máximo
- COUNT(nome_coluna) -> Contagem

In [9]:
query = """
SELECT
    c.curso, 
    COUNT(c.valor_curso) AS media
FROM ada.transacoes AS t
LEFT JOIN ada.cursos AS c ON t.id_curso = c.id_curso
GROUP BY c.curso
"""

df = pd.read_sql_query(query, con = conn)
print(df.shape)
df

(4, 2)

              curso  media
0   arquiteto dados      5
1     ciencia dados     13
2     analise dados      8
3  engenharia dados      8

In [31]:
# Conecte o curso a tabela de transações
query = """
SELECT
    c.curso,
    SUM(c.valor_curso) AS "acumulado"
FROM ada.transacoes AS t
LEFT JOIN ada.cursos AS c ON t.id_curso = c.id_curso
GROUP BY c.curso
"""

df = pd.read_sql_query(query, con = conn)
df

              curso  acumulado
0   arquiteto dados      400.0
1     ciencia dados      910.0
2     analise dados      400.0
3  engenharia dados      480.0

In [11]:
# Conecte o curso a tabela de transações

In [12]:
# Conecte o curso a tabela de transações
query = """
SELECT
* 
FROM 
ada.vendedores
"""

df = pd.read_sql_query(query, con = conn)
df

   id_vendedor vendedor
0            1    paulo
1            2  adriana
2            3    nadir

1) Quantos cursos cada vendedor vendeu?

In [32]:
query = """
SELECT  
    v.vendedor, 
    COUNT(t.id_vendedor) 
FROM ada.vendedores AS v 
LEFT JOIN ada.transacoes AS t ON v.id_vendedor = t.id_vendedor
GROUP BY vendedor
"""

df = pd.read_sql_query(query, con = conn)
df

  vendedor  count
0    paulo     14
1    nadir      7
2  adriana     13

In [40]:
# Conecte o curso a tabela de transações
query = """
SELECT  
    t.id_vendedor, 
    v.vendedor,
    c.curso, 
    COUNT(t.id_curso) AS "quantidade",
    SUM(c.valor_curso) AS "valor total" 
FROM ada.transacoes AS t 
LEFT JOIN ada.vendedores AS v ON v.id_vendedor = t.id_vendedor
LEFT JOIN ada.cursos AS c ON c.id_curso = t.id_curso
GROUP BY 
    t.id_vendedor, 
    v.vendedor,
    c.curso
ORDER BY id_vendedor
"""

df = pd.read_sql_query(query, con = conn)
df

   id_vendedor vendedor             curso  quantidade  valor total
0            1    paulo     analise dados           4        200.0
1            1    paulo     ciencia dados           6        420.0
2            1    paulo  engenharia dados           4        240.0
3            2  adriana   arquiteto dados           5        400.0
4            2  adriana     ciencia dados           4        280.0
5            2  adriana  engenharia dados           4        240.0
6            3    nadir     analise dados           4        200.0
7            3    nadir     ciencia dados           3        210.0

In [46]:
# Conecte o curso a tabela de transações
query = """
SELECT  
    t.id_vendedor, 
    v.vendedor,
    c.curso, 
    COUNT(t.id_curso) AS "quantidade",
    SUM(c.valor_curso) AS "valor total" 
FROM ada.transacoes AS t 
LEFT JOIN ada.vendedores AS v ON v.id_vendedor = t.id_vendedor
LEFT JOIN ada.cursos AS c ON c.id_curso = t.id_curso
GROUP BY 
    t.id_vendedor, 
    v.vendedor,
    c.curso

HAVING SUM(c.valor_curso) > 300

ORDER BY id_vendedor
"""

df = pd.read_sql_query(query, con = conn)
df

   id_vendedor vendedor            curso  quantidade  valor total
0            1    paulo    ciencia dados           6        420.0
1            2  adriana  arquiteto dados           5        400.0

2) Qual o montante vendido por cada vendedor?

In [15]:
# Conecte o curso a tabela de transações
query = """
SELECT  
    t.id_vendedor, 
    v.vendedor, 
    SUM(c.valor_curso) AS "montante"
FROM ada.transacoes AS t 
LEFT JOIN ada.vendedores AS v ON v.id_vendedor = t.id_vendedor
LEFT JOIN ada.cursos AS c on t.id_curso = c.id_curso
GROUP BY 
    t.id_vendedor, 
    v.vendedor
"""

df = pd.read_sql_query(query, con = conn)
df

   id_vendedor vendedor  montante
0            1    paulo     860.0
1            3    nadir     410.0
2            2  adriana     920.0

In [16]:
# Conecte o curso a tabela de transações
query = """
SELECT  
    t.id_vendedor, 
    v.vendedor, 
    SUM(c.valor_curso) AS "montante"
FROM ada.transacoes AS t 
LEFT JOIN ada.vendedores AS v ON v.id_vendedor = t.id_vendedor
LEFT JOIN ada.cursos AS c on t.id_curso = c.id_curso
GROUP BY 
    2, 
    1
"""

df = pd.read_sql_query(query, con = conn)
df

   id_vendedor vendedor  montante
0            2  adriana     920.0
1            1    paulo     860.0
2            3    nadir     410.0

3. Quantos de cada curso foi vendido por cada vendedor?

4. Qual o montande de cada curso  arrecadado por cada vendedor?

# Dica "inFAOlível" da ordem das operações na query

- F: Filtra -> WHERE
- A: Agrega -> GROUP BY
- O: Ordena -> ORDER BY

# Exercício 1:

Construa a tabela inicial sem a normalização.

In [17]:
query = """
SELECT

    -- TRANSACOES
    t.id_transacao,

    -- CURSOS
    t.id_curso,
    c.curso,
    c.valor_curso,

    -- ALUNOS
    t.id_aluno,
    a.primeiro_nome, 
    a.ultimo_nome,
    a.cpf,
    a.data_ingresso, 
    a.endereco, 
    a.numero, 
    a.telefone_a, 
    a.telefone_b, 

    -- CIDADES
    a.id_cidade, 
    cid.cidade,
    cid.estado,

    -- VENDEDORES
    t.id_vendedor,
    v.vendedor,

    -- PAGAMENTOS
    t.id_pagamento,
    p.pagamento

-- NOSSA TABELA PRINCIPAL FIXADA NA ESQUERDA    
FROM ada.transacoes t

    -- COLANDO A TABELA DE CURSOS
    LEFT JOIN ada.cursos c ON t.id_curso = c.id_curso

    -- COLANDO A TABELA DE ALUNOS 
    LEFT JOIN ada.alunos a ON t.id_aluno = a.id_aluno

    -- COLANDO A TABELA DE CIDADES (NOS ALUNOS)
    LEFT JOIN ada.cidades cid ON a.id_cidade = cid.id_cidade

    -- COLANDO A TABELA DE VENDEDORES
    LEFT JOIN ada.vendedores v ON t.id_vendedor = v.id_vendedor

    -- COLANDO A TABELA DE PAGAMENTOS
    LEFT JOIN ada.pagamentos p ON t.id_pagamento = p.id_pagamento
;

"""

dd = pd.read_sql_query(query, con = conn)
dd.head()

,id_transacao,id_curso,curso,valor_curso,id_aluno,primeiro_nome,ultimo_nome,cpf,data_ingresso,endereco,numero,telefone_a,telefone_b,id_cidade,cidade,estado,id_vendedor,vendedor,id_pagamento,pagamento
0,1,1,engenharia dados,60.0,1,abelar,henrique,68740550196,2023-03-05,Rua da Penha,3300,866862753,274845545,1,curitiba,PR,1,paulo,1,a vista
1,2,1,engenharia dados,60.0,2,adriano,gambetta,34146481132,2023-03-06,Rua Henrique Soares,7118,273807947,0,1,curitiba,PR,2,adriana,2,credito
2,3,1,engenharia dados,60.0,3,alex,moulin,12728282203,2023-03-07,Rua Leodécio Santiago de Souza,6082,872235320,911955261,1,curitiba,PR,1,paulo,2,credito
3,4,1,engenharia dados,60.0,4,álvaro,fonseca,43764914607,2023-03-08,Rua Pitica,7924,938535574,262020598,1,curitiba,PR,2,adriana,1,a vista
4,5,1,engenharia dados,60.0,5,andre,melchior,23228327392,2023-03-09,Rua Camilo Paula,4160,189494206,323561018,2,sao paulo,SP,1,paulo,3,pix

### Exercício 2:

Realize uma query com a média do recebido por curso

### Exercício 3: 

Realize uma query que calcule o quanto foi recebido de alunos que começam com a letra A;

### Exercício 4: 

Realize uma query que calcule quanto foi recebido de cada cidade


E se eu quiser ver resultados acima de um valor específico? Como filtro o Group By?

In [86]:
# Conecte o curso a tabela de transações
query_1 = """
SELECT 
    SUM(soma)
FROM 
(SELECT  
    ci.id_cidade, 
    ci.cidade,
    SUM(c.valor_curso) AS soma
FROM ada.transacoes AS t 
LEFT JOIN ada.alunos AS a ON t.id_aluno = a.id_aluno
LEFT JOIN ada.cidades AS ci ON a.id_cidade = ci.id_cidade
LEFT JOIN ada.cursos AS c ON c.id_curso = t.id_curso
GROUP BY ci.id_cidade, ci.cidade

HAVING  SUM(c.valor_curso) >= 200) AS minha_tabela
"""

df = pd.read_sql_query(query_1, con = conn)
df

      sum
0  1250.0

In [19]:
query = f"""
SELECT 
    AVG(soma)
FROM (
    {query_1}
) AS essa_tabela_ai
"""

df = pd.read_sql_query(query, con = conn)
df

     avg
0  312.5

In [87]:
# SUBQUERY

query = """
WITH tabela_1 AS 
(    SELECT  
        ci.id_cidade, 
        SUM(c.valor_curso) AS soma
    FROM ada.transacoes AS t 
    LEFT JOIN ada.alunos AS a ON t.id_aluno = a.id_aluno
    LEFT JOIN ada.cidades AS ci ON a.id_cidade = ci.id_cidade
    LEFT JOIN ada.cursos AS c ON c.id_curso = t.id_curso
    GROUP BY ci.id_cidade

    HAVING  SUM(c.valor_curso) >= 200
),
tabela_2 AS (
    SELECT * FROM show
)

SELECT 
    AVG(soma)
FROM tabela_1
LEFT JOIN tabela_2 ON asdkfjhasldfkahsd

"""

df = pd.read_sql_query(query, con = conn)
df

     avg
0  312.5

### Exercício 5:

Realize uma query que calcule o quanto foi recebido por cada estado.

In [71]:
query = """
SELECT 
    UPPER(ci.estado),  
    SUM(c.valor_curso) AS "acumulado"
FROM ada.transacoes AS t 
LEFT JOIN ada.cursos AS c ON c.id_curso = t.id_curso
LEFT JOIN ada.alunos AS a ON a.id_aluno = t.id_aluno
LEFT JOIN ada.cidades AS ci ON a.id_cidade = ci.id_cidade
GROUP BY UPPER(ci.estado)
ORDER BY acumulado DESC
"""

df = pd.read_sql_query(query, con = conn)
df

  upper  acumulado
0    PR      520.0
1    MG      500.0
2    BA      490.0
3    RO      440.0
4    SP      240.0

In [67]:
"sHoW".swapcase()

'ShOw'

### Exercício 6:

Realize queryes para saber quem trouxe mais dinheiro: pessoas com dois telefones ou com um telefone?

### Exercício 7:

Realize uma query para saber qual foi o lucrado total por cada vendedor

### Exercício 8:

Realize uma query para saber o valor médio das vendas de cada vendedor

### Exercicio 9:

Qual vendedor vendeu mais cursos?

### Exercício 10: 

Quais os tipos de pagamentos mais usado por cada vendedor?

### Exercício 11: 

Quais tipos de pagamentos são mais utilizados?

### Exercício 12: 

Quais pagamentos levantam mais montante de dinheiro?

### Exercício 13:

Quais pagamentos apresentam os maiores valores médio?

### Exercício 14:

Quais as cidades que cada vendedor atua mais?

### Exercício 15: 

Qual o curso preferido de cada cidade?

### Exercício 16:

Qual o montante mensal recebido?

### Exercício 17:

Qual a média mensal recebida?

### Exerício 18: 

Dos alunos com dois telefones, qual montante levantado por cada tipo de pagamento?

### Exercício 19: 

Quais os cursos mais frequentes e quais os montates levantados pelos alunos que contém a letra G no nome?

### Exercício 20: 

Quantos alunos temos por cada cidade? Mais alunos na cidade significa maior montante gerado pela cidade?